yannlossouarn/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* Forward declarations */
static void update_blade_led(void);

/* ---------------------------------------------------------------------------
 * COBS packet handlers (Host -> Firmware)
 * ---------------------------------------------------------------------------*/

static void on_heartbeat(const uint8_t *data, size_t len)
{
    if (len < sizeof(pkt_heartbeat_t) - 2u) {
        return;
    }

    const pkt_heartbeat_t *pkt = (const pkt_heartbeat_t *)data;

    last_heartbeat_tick = HAL_GetTick();

    if (pkt->emergency_requested) {
        Emergency_SetState(1);
    }
    if (pkt->emergency_release_requested) {
        /* Only clear emergency if no physical sensor is still asserted.
         * Firmware is the sole safety authority — never bypass hardware. */
        if (!Emergency_StopButtonYellow() && !Emergency_StopButtonWhite() &&
            !Emergency_WheelLiftBlue() && !Emergency_WheelLiftRed() &&
            !Emergency_Tilt() && !Emergency_LowZAccelerometer()) {
            Emergency_SetState(0);
        } else {
            debug_printf("emergency release rejected: physical sensor still active\r\n");
        }
    }
}

static void on_cmd_vel(const uint8_t *data, size_t len)
{
    if (len < sizeof(pkt_cmd_vel_t) - 2u) {
        return;
    }

    const pkt_cmd_vel_t *pkt = (const pkt_cmd_vel_t *)data;

    last_cmd_vel_tick = HAL_GetTick();

    if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
        return;
    }

    const float vx = pkt->linear_x;
    const float wz = pkt->angular_z;

    /* Differential-drive inverse kinematics — per-wheel linear speed. */
    float left_mps  = vx - wz * WHEEL_BASE * 0.5f;
    float right_mps = vx + wz * WHEEL_BASE * 0.5f;

    if (left_mps  >  MAX_MPS) left_mps  =  MAX_MPS;
    if (left_mps  < -MAX_MPS) left_mps  = -MAX_MPS;
    if (right_mps >  MAX_MPS) right_mps =  MAX_MPS;
    if (right_mps < -MAX_MPS) right_mps = -MAX_MPS;

    /* Hand the target wheel velocities to the PI loop in motors_handler.
     * The mapping to PWM (feedforward + closed-loop correction) lives
     * there now so the integrator can bridge the static-friction
     * deadband on sub-deadband commands. */
    left_target_mps  = left_mps;
    right_target_mps = right_mps;
}

static void on_hl_state(const uint8_t *data, size_t len)
{
    if (len < sizeof(pkt_hl_state_t) - 2u) {
        return;
    }

    const pkt_hl_state_t *pkt = (const pkt_hl_state_t *)data;

    hl_current_mode = pkt->current_mode;
    hl_gps_quality  = pkt->gps_quality;

    // Update panel LEDs based on mode
    if (hl_gps_quality < 90) {
        PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_OFF);
    } else {
        PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_ON);
    }

    // Map host mode to internal status for motor safety.
    // Constants defined in mowgli_protocol.h — keep in sync with HighLevelStatus.msg.
    switch (hl_current_mode) {
    case HL_MODE_AUTONOMOUS:
        PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
        PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
        main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
        break;
    case HL_MODE_RECORDING:
        PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
        PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
        main_eOpenmowerStatus = OPENMOWER_STATUS_RECORD;
        break;
    case HL_MODE_MANUAL_MOWING:
        PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
        PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
        main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
        break;
    case HL_MODE_NULL:
    case HL_MODE_IDLE:
    default:
        PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
        PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
        PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
        PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
        PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
        main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;
        left_target_mps = right_target_mps = 0.0f;
        blade_on_off = target_blade_on_off = 0;
        break;
    }

    update_blade_led();
}

static void on_cmd_blade(const uint8_t *data, size_t len)
{
    if (len < sizeof(pkt_cmd_blade_t) - 2u) {
        return;
    }

    const pkt_cmd_blade_t *pkt = (const pkt_cmd_blade_t *)data;
    target_blade_on_off = pkt->blade_on;
    blade_direction = pkt->blade_dir;
}

/* on_hl_state blade LED feedback (moved out of on_hl_state for clarity) */
static void update_blade_led(void)
{
    if (target_blade_on_off) {
        #ifdef PANEL_LED_2H
        if (BLADEMOTOR_bActivated) {
            PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_FLASH_SLOW);
        } else {
            PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_ON);
        }
        #endif
    } else {
        #ifdef PANEL_LED_2H
        PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_OFF);
        #endif
    }
}

/* ---------------------------------------------------------------------------
 * USB CDC receive callback — feeds COBS layer
 * ---------------------------------------------------------------------------*/
uint8_t CDC_DataReceivedHandler(const uint8_t *Buf, uint32_t len)
{
    mowgli_comms_process_rx(Buf, (size_t)len);
    return CDC_RX_DATA_HANDLED;
}

/* ---------------------------------------------------------------------------
 * usb_cdc_transmit — required by mowgli_comms.c
 * ---------------------------------------------------------------------------*/
void usb_cdc_transmit(const uint8_t *buf, size_t len)
{
    CDC_Transmit(buf, (uint32_t)len);
}

/* ---------------------------------------------------------------------------
 * LED blink + reboot handler (replaces chatter_handler)
 * ---------------------------------------------------------------------------*/
extern "C" void chatter_handler()
{
    if (NBT_handler(&led_nbt)) {
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);

        if (reboot_flag) {
            NVIC_SystemReset();
        }
    }
}

/* ---------------------------------------------------------------------------
 * Drive & blade motors handler
 * ---------------------------------------------------------------------------*/
extern "C" void motors_handler()
{
    if (NBT_handler(&motors_nbt)) {
        /* Snapshot ISR-written variables under interrupt lock */
        __disable_irq();
        float    snap_left_target  = left_target_mps;
        float    snap_right_target = right_target_mps;
        uint8_t  snap_target_blade = target_blade_on_off;
        uint32_t snap_heartbeat    = last_heartbeat_tick;
        uint32_t snap_cmd_vel      = last_cmd_vel_tick;
        __enable_irq();

        blade_on_off = snap_target_blade;

        /* --- decide effective target ---
         * Emergency or cmd_vel watchdog timeout overrides to a hard stop.
         * Otherwise the snapshot value drives the PI loop below. */
        bool hard_stop = false;
        if (Emergency_State()) {
            hard_stop = true;
            blade_on_off = 0;
        } else {
            const uint32_t cmd_vel_age_ms = HAL_GetTick() - snap_cmd_vel;
            if (cmd_vel_age_ms > 200u) {
                /* Command-vel watchdog: zero motors if the host hasn't
                 * sent a twist in 200 ms (Pi hang, USB glitch, etc). */
                hard_stop = true;
            }
            if (cmd_vel_age_ms > 25000u) {
                blade_on_off = 0;
            }
        }

        const float l_target = hard_stop ? 0.0f : snap_left_target;
        const float r_target = hard_stop ? 0.0f : snap_right_target;

#if USE_WHEEL_PI
        /* Wheel-level PI loop.
         *
         * Reads the signed cumulative encoder count maintained by
         * drivemotor.c, derives actual_mps over the 20 ms loop
         * period, computes a feedforward + PI PWM. The integrator
         * is what bridges the static-friction deadband: while the
         * target says "move 0.05 m/s" and the encoder says "0",
         * Ki × error × dt accumulates until the PWM crosses the
         * deadband (~40), the motor breaks free, the wheel starts
         * counting ticks, error drops, and the integrator settles
         * at whatever PWM keeps that wheel at target speed.
         *
         * Read left_ticks_signed/right_ticks_signed directly (these are
         * 32-bit and updated from the drivemotor rx-decode path —
         * not strictly atomic, but a torn read here costs at most
         * one 20 ms loop of incorrect velocity, then converges). */
        const int32_t cur_left_ticks  = left_ticks_signed;
        const int32_t cur_right_ticks = right_ticks_signed;
        const int32_t dleft_ticks  = cur_left_ticks  - prev_left_ticks_signed_pi;
        const int32_t dright_ticks = cur_right_ticks - prev_right_ticks_signed_pi;
        prev_left_ticks_signed_pi  = cur_left_ticks;
        prev_right_ticks_signed_pi = cur_right_ticks;

        const float l_actual_mps =
            ((float)dleft_ticks)  / WHEEL_PI_TICKS_PER_M / WHEEL_PI_DT_S;
        const float r_actual_mps =
            ((float)dright_ticks) / WHEEL_PI_TICKS_PER_M / WHEEL_PI_DT_S;

