yannlossouarn/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
        const float l_err = l_target - l_actual_mps;
        const float r_err = r_target - r_actual_mps;

        /* Reset the integral on direction reversal or stop-to-go
         * transitions. Without this the integral built up while
         * decelerating would drive the motor backwards as soon as
         * the chassis stopped, causing micro-oscillations. */
        const bool l_target_sign_changed =
            (l_target * prev_left_target_mps  < 0.0f) ||
            (l_target == 0.0f && prev_left_target_mps  != 0.0f) ||
            hard_stop;
        const bool r_target_sign_changed =
            (r_target * prev_right_target_mps < 0.0f) ||
            (r_target == 0.0f && prev_right_target_mps != 0.0f) ||
            hard_stop;
        if (l_target_sign_changed) left_pi_int_pwm  = 0.0f;
        if (r_target_sign_changed) right_pi_int_pwm = 0.0f;
        prev_left_target_mps  = l_target;
        prev_right_target_mps = r_target;

        /* Integrate error with anti-windup clamp on the PWM-equivalent
         * accumulator. */
        left_pi_int_pwm  += WHEEL_PI_KI_PWM_PER_MPS_S * l_err * WHEEL_PI_DT_S;
        right_pi_int_pwm += WHEEL_PI_KI_PWM_PER_MPS_S * r_err * WHEEL_PI_DT_S;
        if (left_pi_int_pwm  >  WHEEL_PI_INT_MAX_PWM) left_pi_int_pwm  =  WHEEL_PI_INT_MAX_PWM;
        if (left_pi_int_pwm  < -WHEEL_PI_INT_MAX_PWM) left_pi_int_pwm  = -WHEEL_PI_INT_MAX_PWM;
        if (right_pi_int_pwm >  WHEEL_PI_INT_MAX_PWM) right_pi_int_pwm =  WHEEL_PI_INT_MAX_PWM;
        if (right_pi_int_pwm < -WHEEL_PI_INT_MAX_PWM) right_pi_int_pwm = -WHEEL_PI_INT_MAX_PWM;

        /* Feedforward + proportional + integrator. Sign carried through. */
        const float l_pwm_f = l_target * PWM_PER_MPS
                            + WHEEL_PI_KP_PWM_PER_MPS * l_err
                            + left_pi_int_pwm;
        const float r_pwm_f = r_target * PWM_PER_MPS
                            + WHEEL_PI_KP_PWM_PER_MPS * r_err
                            + right_pi_int_pwm;

        /* When the target is exactly zero AND we're not braking from a
         * larger speed, force PWM to zero outright — avoids the residual
         * "hum" from a non-zero integral applied to a stopped wheel. */
        left_pwm_signed  = (l_target == 0.0f && fabsf(l_actual_mps) < 0.02f)
                          ? 0
                          : (int16_t)l_pwm_f;
        right_pwm_signed = (r_target == 0.0f && fabsf(r_actual_mps) < 0.02f)
                          ? 0
                          : (int16_t)r_pwm_f;
#else
        /* Open-loop fallback for bring-up / regression A/B. Replicates the
         * pre-PI mapping exactly: PWM = target × PWM_PER_MPS, no encoder
         * feedback, no integrator. */
        left_pwm_signed  = (int16_t)(l_target * PWM_PER_MPS);
        right_pwm_signed = (int16_t)(r_target * PWM_PER_MPS);
#endif

        if (hard_stop) {
            DRIVEMOTOR_SetSpeedSigned(0, 0);
        } else {
            DRIVEMOTOR_SetSpeedSigned(left_pwm_signed, right_pwm_signed);
        }

        // Heartbeat watchdog: if no heartbeat for HEARTBEAT_TIMEOUT_MS, emergency stop
        if (snap_heartbeat != 0 &&
            (HAL_GetTick() - snap_heartbeat) > HEARTBEAT_TIMEOUT_MS) {
            Emergency_SetState(1);
        }

        BLADEMOTOR_Set(blade_on_off, blade_direction);
    }
}

/* ---------------------------------------------------------------------------
 * Panel handler — button presses generate UI events over COBS
 * ---------------------------------------------------------------------------*/
extern "C" void panel_handler()
{
    if (NBT_handler(&panel_nbt)) {
        PANEL_Tick();

        if (buttonupdated == 1 && buttoncleared == 0) {
            pkt_ui_event_t evt;
            evt.type = PKT_ID_UI_EVENT;
            evt.press_duration = 0;  // short press

            // Map physical buttons to IDs
            if (buttonstate[PANEL_BUTTON_DEF_S1]) {
                evt.button_id = 1;
                mowgli_comms_send(&evt, sizeof(evt));
            }
            if (buttonstate[PANEL_BUTTON_DEF_S2]) {
                evt.button_id = 2;
                mowgli_comms_send(&evt, sizeof(evt));
            }
            if (buttonstate[PANEL_BUTTON_DEF_LOCK]) {
                evt.button_id = 3;
                mowgli_comms_send(&evt, sizeof(evt));
            }
            if (buttonstate[PANEL_BUTTON_DEF_START]) {
                evt.button_id = 4;
                mowgli_comms_send(&evt, sizeof(evt));
            }
            if (buttonstate[PANEL_BUTTON_DEF_HOME]) {
                evt.button_id = 5;
                mowgli_comms_send(&evt, sizeof(evt));
            }

            buttonupdated = 0;
        }
    }
}

#if OPTION_ULTRASONIC == 1
extern "C" void ultrasonic_handler(void)
{
    // USS data is included in the status packet — no separate packet needed.
    // This handler is kept for the main loop call in main.c.
}
#endif

/* ---------------------------------------------------------------------------
 * Wheel ticks handler — called from DRIVEMOTOR_App_Rx() every 20 ms.
 *
 * Builds the odometry packet from signed cumulative ticks. Per-wheel
 * velocity is computed here (not on the Pi) because the firmware has the
 * hardware-timer-accurate dt. All four quantities in the packet are
 * signed; the host doesn't need a direction byte or to re-sign anything.
 * ---------------------------------------------------------------------------*/
extern "C" void wheelTicks_handler(
    int32_t  p_s32LeftTicksSigned,
    int32_t  p_s32RightTicksSigned,
    int16_t  p_s16LeftSpeed,   /* currently unused — reserved for future telemetry */
    int16_t  p_s16RightSpeed)
{
    (void)p_s16LeftSpeed;
    (void)p_s16RightSpeed;

    static int32_t prev_left_ticks  = 0;
    static int32_t prev_right_ticks = 0;

    const uint32_t now_tick = HAL_GetTick();
    const uint16_t dt_ms    = (uint16_t)(now_tick - last_odom_tick);
    last_odom_tick = now_tick;

    const int32_t delta_left  = p_s32LeftTicksSigned  - prev_left_ticks;
    const int32_t delta_right = p_s32RightTicksSigned - prev_right_ticks;
    prev_left_ticks  = p_s32LeftTicksSigned;
    prev_right_ticks = p_s32RightTicksSigned;

    /* Velocity: mm/s = (delta_ticks / TICKS_PER_M) * (1000 / dt_ms) * 1000
     *                = delta_ticks * 1e6 / (TICKS_PER_M * dt_ms).
     * TICKS_PER_M is 300, so the constant numerator (300 * dt_ms) stays
     * comfortably inside int32 for any realistic dt. We still cast to
     * int64 for the mul to be safe on large tick deltas.                  */
    int16_t left_v_mm_s  = 0;
    int16_t right_v_mm_s = 0;
    if (dt_ms > 0)
    {
        const int64_t denom = (int64_t)TICKS_PER_M * (int64_t)dt_ms;
        int64_t v_l = ((int64_t)delta_left  * 1000000LL) / denom;
        int64_t v_r = ((int64_t)delta_right * 1000000LL) / denom;
        if (v_l >  32767) v_l =  32767;
        if (v_l < -32768) v_l = -32768;
        if (v_r >  32767) v_r =  32767;
        if (v_r < -32768) v_r = -32768;
        left_v_mm_s  = (int16_t)v_l;
        right_v_mm_s = (int16_t)v_r;
    }

